app/controllers/articles_controller.rb

  def create
    # render plain: params[article].inspect
    # @article = Article.new(params[:article])
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "abcdef"], ["text", "the first article"], ["created_at", "2017-09-01 02:18:10.027606"], ["updated_at", "2017-09-01 02:18:10.027606"]]